socialNetwork/logs/containers2_2000r_100c_t8_d1m_rr.txt
Running 1m test @ http://localhost:8080/wrk2-api/user/register
  8 threads and 100 connections

  Thread calibration: mean lat.: 0.273ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.282ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.274ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.275ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.279ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user/register 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   277.05us  113.36us 612.00us   90.05%
    Req/Sec   264.19    166.88   700.00     74.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  255.00us
 75.000%  306.00us
 90.000%  383.00us
 99.000%  612.00us
 99.900%    0.87ms
 99.990%    4.32ms
 99.999%    8.84ms
100.000%    9.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.007     0.000000            1         1.00
       0.195     0.100000        10096         1.11
       0.212     0.200000        20286         1.25
       0.226     0.300000        30350         1.43
       0.240     0.400000        40445         1.67
       0.255     0.500000        50646         2.00
       0.263     0.550000        55638         2.22
       0.271     0.600000        60337         2.50
       0.281     0.650000        65507         2.86
       0.292     0.700000        70457         3.33
       0.306     0.750000        75324         4.00
       0.315     0.775000        77986         4.44
       0.324     0.800000        80377         5.00
       0.335     0.825000        82855         5.71
       0.348     0.850000        85367         6.67
       0.363     0.875000        87839         8.00
       0.373     0.887500        89149         8.89
       0.383     0.900000        90366        10.00
       0.394     0.912500        91554        11.43
       0.407     0.925000        92813        13.33
       0.424     0.937500        94064        16.00
       0.433     0.943750        94685        17.78
       0.444     0.950000        95360        20.00
       0.456     0.956250        95971        22.86
       0.472     0.962500        96559        26.67
       0.489     0.968750        97204        32.00
       0.500     0.971875        97508        35.56
       0.513     0.975000        97840        40.00
       0.528     0.978125        98154        45.71
       0.544     0.981250        98448        53.33
       0.565     0.984375        98760        64.00
       0.577     0.985938        98923        71.11
       0.588     0.987500        99071        80.00
       0.603     0.989062        99234        91.43
       0.618     0.990625        99382       106.67
       0.636     0.992188        99541       128.00
       0.645     0.992969        99616       142.22
       0.657     0.993750        99694       160.00
       0.672     0.994531        99778       182.86
       0.689     0.995313        99853       213.33
       0.713     0.996094        99931       256.00
       0.723     0.996484        99970       284.44
       0.738     0.996875       100009       320.00
       0.751     0.997266       100048       365.71
       0.766     0.997656       100088       426.67
       0.789     0.998047       100131       512.00
       0.797     0.998242       100145       568.89
       0.809     0.998437       100165       640.00
       0.826     0.998633       100184       731.43
       0.845     0.998828       100204       853.33
       0.879     0.999023       100224      1024.00
       0.898     0.999121       100233      1137.78
       0.916     0.999219       100244      1280.00
       0.938     0.999316       100253      1462.86
       0.969     0.999414       100263      1706.67
       1.021     0.999512       100273      2048.00
       1.037     0.999561       100278      2275.56
       1.048     0.999609       100282      2560.00
       1.076     0.999658       100287      2925.71
       1.188     0.999707       100293      3413.33
       1.364     0.999756       100297      4096.00
       1.428     0.999780       100299      4551.11
       1.482     0.999805       100302      5120.00
       1.503     0.999829       100304      5851.43
       1.965     0.999854       100307      6826.67
       2.809     0.999878       100309      8192.00
       2.855     0.999890       100310      9102.22
       4.407     0.999902       100312     10240.00
       5.207     0.999915       100313     11702.86
       5.363     0.999927       100314     13653.33
       6.319     0.999939       100315     16384.00
       6.619     0.999945       100316     18204.44
       7.499     0.999951       100317     20480.00
       7.499     0.999957       100317     23405.71
       7.683     0.999963       100318     27306.67
       7.683     0.999969       100318     32768.00
       7.979     0.999973       100319     36408.89
       7.979     0.999976       100319     40960.00
       7.979     0.999979       100319     46811.43
       8.839     0.999982       100320     54613.33
       8.839     0.999985       100320     65536.00
       8.839     0.999986       100320     72817.78
       8.839     0.999988       100320     81920.00
       8.839     0.999989       100320     93622.86
       9.007     0.999991       100321    109226.67
       9.007     1.000000       100321          inf
#[Mean    =        0.277, StdDeviation   =        0.113]
#[Max     =        9.000, Total count    =       100321]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  120135 requests in 1.00m, 22.80MB read
Requests/sec:   2002.07  
Transfer/sec:    389.07KB